#!/bin/bash

# Dừng script ngay lập tức nếu có lệnh bị lỗi
set -euo pipefail
# -------------------------------------------------------------------------------------------------------------------------------

# +++

# -------------------------------------------------------------------------------------------------------------------------------
# Kiểm tra quyền
# NÂNG QUYỀN NẾU KHÔNG PHẢI LÀ ROOT
# 1. Kiểm tra xem đang chạy với quyền gì
if [[ $EUID -ne 0 ]]; then
   # 1.1. Nếu không phải root, tự động chạy lại script này bằng sudo
   # Thêm tham số -E cho sudo để giữ lại các biến môi trường (nếu có)
   sudo -E "$0" "$@"
   # 1.2. Thoát tiến trình cũ (không phải root) để tiến trình mới (có root) chạy
   exit $?
fi

# Tham số đầu vào mặc định ở vị trí đầu tiên (1)
# Xác định kiểu pass cần hiển thị
# Chung cho cả 3 file hiển thị pass WordPress (wpp.txt), sFTP (sftpp.txt), Adminer (adminerp.txt)
WHAT_PASS="${1:-nopa}"
# -------------------------------------------------------------------------------------------------------------------------------

# +++

# -------------------------------------------------------------------------------------------------------------------------------
# 2. Xác định thư mục chứa file
SCRIPT_WPSILA_DIR="$( cd "$( dirname "${BASH_SOURCE[0]}" )" &> /dev/null && pwd )"
# -------------------------------------------------------------------------------------------------------------------------------

# +++

# -------------------------------------------------------------------------------------------------------------------------------
# 3. Tạo đường dẫn file đầy đủ tới file chứa pass
TARGET_FILE="$SCRIPT_WPSILA_DIR/${WHAT_PASS}"
# -------------------------------------------------------------------------------------------------------------------------------

# +++

# -------------------------------------------------------------------------------------------------------------------------------
# 4. Kiểm tra và chạy lệnh
if [ -f "$TARGET_FILE" ]; then
    echo "Dang doc file tai: $TARGET_FILE"
	
	# Hiển thị pass
    cat "$TARGET_FILE"
else
    echo "KHONG tim thay file tai $TARGET_FILE."
fi
# -------------------------------------------------------------------------------------------------------------------------------